app/views/shared/_feed_item.html.erb

SELECT "memberships".* FROM "memberships" WHERE "memberships"."member_of_id" = 11 AND "memberships"."member_of_id" = 1 LIMIT 1
---
    <% if current_user.attend?(feed_item) %>
      <%= form_for(feed_item.reverse_memberships.find_by_member_of_id(feed_item),
                   html: { method: :delete }
                   ) do |f| %>