app/views/microposts/_micropost.html.erb

	  <% if current_user.attend?(micropost) %>
			<%= form_for(micropost.reverse_memberships.find_by_member_of_id(micropost),
			             html: { method: :delete },
			             ) do |f| %>
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."member_of_id" = 8 AND "memberships"."member_of_id" = 1 LIMIT 1