app/controllers/memberships_controller.rb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "2"]]
---
  def create
  	#ActiveRecord::Base.connection.clear_cache!
  	@micropost = Micropost.find(params[:membership][:member_of_id])

SELECT "memberships".* FROM "memberships" WHERE "memberships"."member_id" = 4 AND "memberships"."member_of_id" = 8 LIMIT 1
---
  def destroy
    @micropost = Membership.find(params[:id]).member_of