app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$I6XUENVP.jQTxQMhkZuY7.e7OLGxYxNxDAAStdHWoBF.A4Ut/3IeW', "remember_token" = 'a1FV1drEpWpQZUufM3ARKw', "updated_at" = '2013-04-23 21:30:40.629694' WHERE "users"."id" = 31